--[[
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                      ▀▄ ▄▀ 
▀▄ ▄▀    BY OmarReal                       ▀▄ ▄▀ 
▀▄ ▄▀     BY OmarReal (Omar_Real)          ▀▄ ▄▀ 
▀▄ ▄▀ JUST WRITED BY OmarReal              ▀▄ ▄▀   
▀▄ ▄▀                                      ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]]


do

function run(msg, matches)
  return [[ 

🌐 - /ارفع  ادمن : لرفع ادمن
🌐 - /ازالة : لازالة الادمن
🌐 - /ترقية  : اضافة #مدير
🌐 - /الاعدادات : اضهار الاعدادات
➖🔸➖🔹➖🔸➖🔹➖
🔘 -  /اطرد : لطرد المستخدم
🔘 - /حضر :  لحضر المستخدم
🔘 - /الغاء الحضر : لفك حضر المستخدم
🔘 - /مغادرة : للخروج من لمجموعه
🔘 - /صامت  : لكتم المستخدم
🔘 - /صامت  : لالغاء كتم المستخدم
🔘 - /قائمة الكتم : عرض المكتومين
🔘 - / حضر عام : باند عام
🔘 - /الغاء العام : لالغاء العام
➖🔸➖🔹➖🔸➖🔹➖
🔘 - /الاسم : لعرض الايدي بلرد
🔘 - /معلومات : لعرض معلومات المستخدم
🔘 - /ايدي : لعرض ايدي المستخدم
🔘 - /الاسم : لاضهار الاسم والايدي
🔘 - /القوانين : لاضهار القوانين
🔘 - /ضع القوانين : اضافه قوانين
🔵 - /الوصف  : لاضهار الحول
🔵 - /ضع الوصف : اضافة حول 
🔵 - /ضع الاسم : لاضافة اسم
🔵 - /ضع صورة : لاضافة صورة
🔵 - /اضافت رابط : لاضافة رابط
🔵 - /الرابط خاص : لجلب الرابط خاص
🔵 - /الرابط : لعرض الرابط
🔵 - /غير الرابط : تغير الرابط
🔵 - /تحويل سوبر : لتحويل المجموعة الى سوبر
🔵 - /تفعيل : لتفعيل المجموعة
🔵 - /الغاء التفعيل : الغاء تفعيل المجموعة
🔵 - /صورة : لتحويل النص الى صورة
🔵 - موقعي : لاضهار موقعك 
🔵 - /صوت : لتحويل النص الى كلام
➖🔸➖🔹➖🔸➖🔹➖
🔵 - /اقفل|فتح الاعلانات : منع الروابط والاعلانات
🔵 - /اقفل|فتح الصور : منع الصور
🔵 - /اقفل|فتح الملصقات : منع ملصقات
🔵 - /اقفل|فتح الصور المتحركة : منع الصور المتحركة
🔴 - /اقفل|فتح الصوتيات : منع بصمات
🔴 - /اقفل|فتح الفديوات : منع فديوات
🔴 - /اقفل|فتح النص : لقفل النص
🔴 - /اقفل|فتح جهات الاتصال : لقفل مشاركة جهات الاتصال
🔴 - /اقفل|فتح المحادثه : لقفل المحادثة
🔴 - /اقفل|فتح الكلايش الطويلة : منع الكلايش الطويلة
🔴 - /اقفل|فتح التكرار : قفل التكرار
🔴 - /ضع التكرار [5-20] تحديد عدد التكرار من
🔴 - /اقفل|فتح الاشعارات : لقفل الاشعارات
🔴 - /اقفل|فتح الملفات : لقفل الملفات
🔴 - /ضع المعرف : وضع معرف للمجموعة
🔴 - /مسح : لحذف اي رسالة بل رد
🔴 - /منع + الكلمة  : لحضر كلمة معينة
🔴 - /سماح + لاغاء حضر الكلمة
🔴 - /امسح الكلمات الممنوعة : لحذف جميع الكلمات الممنوعة
◼️ - /امسح الادمنية : لحذف الادمنية
◼️ - /امسح الوصف : لحذف الوصف
◼️ - /امسح القوانين : لحذف القوانين
◼️ - /امسح المعرف : لحذف معرف المجموعة
◼️ - /انستا : + يوزر : يستعمل لجلب معلومات حساب الانستا مع الصور
◼️ - /اصنع مجموعة : لصنع مجموعة
➖🔸➖🔹➖🔸➖🔹➖
 👾 - Dev - @Omar_Real
 👾 - Dev - @ALNAZEXR
 👾 - Dev - @Mohammedzedan
 👾 - Dev - @X_A_A
 ]]

end

return {
  description = "Shows bot help", 
  -- usage = /مساعدة: Shows bot help",
  patterns = {
    "^/مساعدة$"
  }, 
  run = run 
}

end
